/*
백준 14500번 테트로노미노
브루트포스 재귀
*/
#include <vector>
#include <iostream>
#include <utility>

using namespace std;

int tetrominos[19][4][2] = {
    {{0,0}, {0,1}, {0,2}, {0,3}}, // 일자 테트로미노
    {{0,0}, {1,0}, {2,0}, {3,0}}, 
    {{0,0}, {1,0}, {0,1}, {1,1}}, // 네모 테트로미노
    {{0,0}, {1,0}, {2,0}, {1,1}}, // 뻑큐 테트로미노
    {{1,0}, {0,1}, {1,1}, {1,2}},
    {{1,0}, {0,1}, {1,1}, {2,1}},
    {{0,0}, {0,1}, {0,2}, {1,1}}, 
    {{0,0}, {0,1}, {0,2}, {1,2}}, // ㄱ자 테트로미노
    {{0,1}, {1,1}, {2,1}, {2,0}},
    {{0,0}, {1,0}, {1,1}, {1,2}},
    {{0,0}, {1,0}, {2,0}, {0,1}}, 
    {{0,0}, {1,0}, {2,0}, {2,1}}, // ㄱ자 테트로미노 반전
    {{1,0}, {1,1}, {1,2}, {0,2}},
    {{0,0}, {0,1}, {1,1}, {2,1}},
    {{0,0}, {0,1}, {0,2}, {1,0}}, 
    {{0,0}, {0,1}, {1,1}, {1,2}},
    {{0,1}, {1,1}, {1,0}, {2,0}},
    {{0,0}, {1,0}, {1,1}, {2,1}},
    {{1,0}, {1,1}, {0,1}, {0,2}}  // ㄹ자 테트로미노
};

int main(){
    int m, n;
    int ans = 0;
    cin >> n >> m;
    int board[n][m]; 
    for(int i=0; i<n; i++)
        for(int j=0; j<m; j++)
            cin >> board[i][j];
    
    for(int i=0; i<n; i++){
        for(int j=0; j<m; j++){
            for(int k=0; k<19; k++){
                int temp_sum = 0;
                for(int l=0; l<4; l++){
                    int temp_x = tetrominos[k][l][0] + j;
                    int temp_y = tetrominos[k][l][1] + i;
                    if (temp_x < m && temp_y < n){
                        temp_sum += board[temp_y][temp_x];
                    }else{
                        temp_sum = 0;
                        break;
                    }
                }
                if(temp_sum > ans){
                    ans = temp_sum;
                }
            }
        }
    }

    cout << ans;

    return 0;
}